-- Очищення попередніх даних (якщо є)
DELETE FROM Tickets;
DELETE FROM Sessions;
DELETE FROM Movies;
DELETE FROM Genres;

-- Додавання жанрів
INSERT INTO Genres (GenreName, Description) VALUES
('Наукова Фантастика', 'Фільми про майбутнє, космос та технології'),
(N'Екшн та Бойовики', N'Динамічні фільми з бійками та погонями'),
('Драма та Біографія', 'Глибокі сюжетні стрічки та реальні історії'),
(N'Анімація та Сімейні', N'Мультфільми для перегляду всією родиною');

-- Додавання 6 фільмів різних категорій
INSERT INTO Movies (Title, GenreID, DurationMinutes, AgeRating, BasePrice) VALUES
('Дюна: Частина друга', 1, 166, '16+', 200.00),
('Інтерстеллар', 1, 169, '12+', 180.00),
('Оппенгеймер', 3, 180, '18+', 220.00),
('Дедпул і Росомаха', 2, 127, '18+', 210.00),
('Думками навиворіт 2', 4, 96, '0+', 160.00),
('Кунг-Фу Панда 4', 4, 94, '0+', 150.00);

-- Генерація сеансів на ці фільми
INSERT INTO Sessions (MovieID, HallID, StartTime, TicketPrice) VALUES
(1, 2, '2026-10-01 14:00:00', 200.00),
(2, 1, '2026-10-01 15:30:00', 180.00),
(3, 3, '2026-10-01 19:00:00', 350.00),
(4, 2, '2026-10-01 21:30:00', 230.00),
(5, 1, '2026-10-02 12:00:00', 160.00),
(6, 1, '2026-10-02 14:00:00', 150.00);